[
  { "id": 1, "fact": "Your fingers wrinkle in water to improve grip – it's a survival reflex!", "category": "Biology" },
  { "id": 2, "fact": "Goosebumps are a survival reflex from our hairy ancestors.", "category": "Biology" },
  { "id": 3, "fact": "Sharks existed before trees.", "category": "History" },
  { "id": 4, "fact": "Honey never spoils. Archaeologists have found edible honey in ancient Egyptian tombs.", "category": "Science" },
  { "id": 5, "fact": "A group of flamingos is called a 'flamboyance'.", "category": "Animals" },
  { "id": 6, "fact": "The heart of a blue whale is so big that a human could crawl through the arteries.", "category": "Animals" },
  { "id": 7, "fact": "There are more trees on Earth than stars in the Milky Way galaxy.", "category": "Space" },
  { "id": 8, "fact": "Your stomach gets an entirely new lining every 3-5 days.", "category": "Human Body" },
  { "id": 9, "fact": "Octopuses have three hearts and blue blood.", "category": "Animals" },
  { "id": 10, "fact": "A single cloud can weigh more than a million pounds.", "category": "Weather" },
  { "id": 11, "fact": "Bananas are berries, but strawberries aren't.", "category": "Science" },
  { "id": 12, "fact": "The shortest war in history lasted only 38-45 minutes.", "category": "History" },
  { "id": 13, "fact": "Dolphins have names for each other.", "category": "Animals" },
  { "id": 14, "fact": "The human brain uses 20% of the body's total energy.", "category": "Human Body" },
  { "id": 15, "fact": "Lightning strikes the Earth about 100 times per second.", "category": "Weather" },
  { "id": 16, "fact": "A day on Venus is longer than its year.", "category": "Space" },
  { "id": 17, "fact": "Cats can't taste sweetness.", "category": "Animals" },
  { "id": 18, "fact": "The Great Wall of China isn't visible from space with the naked eye.", "category": "History" },
  { "id": 19, "fact": "Your nose can remember up to 50,000 different scents.", "category": "Human Body" },
  { "id": 20, "fact": "Sea otters hold hands while sleeping so they don't drift apart.", "category": "Animals" },
  { "id": 21, "fact": "Tom Hanks' brother Jim does most of his voice acting for Toy Story video games and commercials.", "category": "Random" },
  { "id": 22, "fact": "The sound of lightsabers in Star Wars was created by combining the hum of old TV sets with film projector motor noise.", "category": "Random" },
  { "id": 23, "fact": "Movie theater popcorn costs more per ounce than filet mignon.", "category": "Random" },
  { "id": 24, "fact": "In Titanic, the scene where Jack draws Rose was actually James Cameron drawing – they just swapped the hands in post-production.", "category": "Random" },
  { "id": 25, "fact": "The word 'set' has the most different meanings in the English language – over 430 distinct definitions.", "category": "Random" },
  { "id": 26, "fact": "Bubble wrap was originally invented as wallpaper.", "category": "Random" },
  { "id": 27, "fact": "The smell of rain has a name: petrichor.", "category": "Science" },
  { "id": 28, "fact": "In movies, when actors eat food, they usually spit it out between takes to avoid getting sick.", "category": "Random" },
  { "id": 29, "fact": "The 'ringing' sound you hear in absolute silence is called tinnitus, and it's actually your brain creating noise.", "category": "Human Body" },
  { "id": 30, "fact": "Movie blood is usually made from corn syrup, food coloring, and chocolate syrup.", "category": "Random" },
  { "id": 31, "fact": "The plastic tips at the end of shoelaces are called aglets.", "category": "Random" },
  { "id": 32, "fact": "A group of ravens is called an 'unkindness' and a group of owls is called a 'parliament'.", "category": "Animals" },
  { "id": 33, "fact": "Most movie 'glass' that actors break through is actually made of sugar or resin.", "category": "Random" },
  { "id": 34, "fact": "Sloths can hold their breath longer than dolphins.", "category": "Animals" },
  { "id": 35, "fact": "There’s enough DNA in the human body to stretch from the sun to Pluto and back — 17 times.", "category": "Biology" },
  { "id": 36, "fact": "The Eiffel Tower can grow up to 6 inches during summer due to heat expansion.", "category": "Science" },
  { "id": 37, "fact": "Wombat poop is cube-shaped to prevent it from rolling away.", "category": "Animals" },
  { "id": 38, "fact": "There is a species of jellyfish that is biologically immortal.", "category": "Biology" },
  { "id": 39, "fact": "Water can boil and freeze at the same time in a process called 'triple point'.", "category": "Science" },
  { "id": 40, "fact": "Giraffes only need 5 to 30 minutes of sleep a day.", "category": "Animals" },
  { "id": 41, "fact": "Oxford University is older than the Aztec Empire.", "category": "History" },
  { "id": 42, "fact": "The moon has moonquakes, similar to earthquakes on Earth.", "category": "Space" },
  { "id": 43, "fact": "Some metals are so reactive that they explode on contact with water.", "category": "Science" },
  { "id": 44, "fact": "There's a basketball court on the top floor of the U.S. Supreme Court building, nicknamed 'the highest court in the land'.", "category": "Random" },
  { "id": 45, "fact": "Mantis shrimps can punch with the speed of a bullet.", "category": "Animals" },
  { "id": 46, "fact": "The inventor of the Pringles can is buried in one.", "category": "Random" },
  { "id": 47, "fact": "Hot water can freeze faster than cold water — this is known as the Mpemba effect.", "category": "Science" },
  { "id": 48, "fact": "Cleopatra lived closer to the invention of the iPhone than to the building of the Great Pyramid.", "category": "History" },
  { "id": 49, "fact": "There are more possible iterations of a game of chess than there are atoms in the observable universe.", "category": "Random" },
  { "id": 50, "fact": "Some turtles can breathe through their butts during hibernation.", "category": "Animals" },
  { "id": 51, "fact": "The cornea is the only part of the human body that has no blood supply and gets oxygen directly from the air.", "category": "Human Body" },
  { "id": 52, "fact": "A single human cell's DNA could fill a million-page book.", "category": "Biology" },
  { "id": 53, "fact": "Butterflies taste with their feet, allowing them to decide where to lay their eggs.", "category": "Animals" },
  { "id": 54, "fact": "The human brain generates about 12-25 watts of electricity, enough to power a low-wattage LED light.", "category": "Human Body" },
  { "id": 55, "fact": "Lungs are the only organs in the human body that can float on water.", "category": "Human Body" },
  { "id": 56, "fact": "Some animals, like birds and bacteria, can detect magnetic fields for navigation.", "category": "Animals" },
  { "id": 57, "fact": "The tongue is the fastest healing part of the human body.", "category": "Human Body" },
  { "id": 58, "fact": "The skin wrinkling in water is an active neurological response that improves grip by channeling water away like tire treads.", "category": "Biology" },
  { "id": 59, "fact": "Laughing when tickled is actually an expression of fear by your brain signalling something crawling on you.", "category": "Human Body" },
  { "id": 60, "fact": "Venomous animals inject venom, whereas poisonous animals are harmful to touch or eat.", "category": "Biology" },
  { "id": 61, "fact": "Sharks have been around for over 400 million years, predating dinosaurs.", "category": "History" },
  { "id": 62, "fact": "Jellyfish have been in the oceans for more than 500 million years.", "category": "Biology" },
  { "id": 63, "fact": "The human body contains about 37.2 trillion cells.", "category": "Human Body" },
  { "id": 64, "fact": "The largest living structure on Earth is the Great Barrier Reef.", "category": "Science" },
  { "id": 65, "fact": "Some fungi can create networks that span miles underground.", "category": "Biology" },
  { "id": 66, "fact": "Saturn is the least dense planet in our solar system; it could float in water.", "category": "Space" },
  { "id": 67, "fact": "The strongest muscle in the human body relative to its size is the masseter (jaw muscle).", "category": "Human Body" },
  { "id": 68, "fact": "The fastest bird is the peregrine falcon, which can reach speeds over 240 mph during a dive.", "category": "Animals" },
  { "id": 69, "fact": "Elephants can communicate using infrasound, sounds below human hearing range.", "category": "Animals" },
  { "id": 70, "fact": "The oldest living tree is a bristlecone pine estimated to be over 5,000 years old.", "category": "Biology" },
  { "id": 71, "fact": "A teaspoon of honey represents the life work of 12 bees.", "category": "Animals" },
  { "id": 72, "fact": "Lightning is five times hotter than the surface of the sun.", "category": "Weather" },
  { "id": 73, "fact": "Neutron stars are so dense that a sugar-cube-sized amount of their material would weigh about 100 million tons.", "category": "Space" },
  { "id": 74, "fact": "Octopuses have the ability to edit their RNA, allowing rapid adaptation.", "category": "Animals" },
  { "id": 75, "fact": "The human heart beats over 3 billion times in an average lifetime.", "category": "Human Body" },
  { "id": 76, "fact": "Saturn's rings are made mostly of ice chunks ranging in size from dust to mountains.", "category": "Space" },
  { "id": 77, "fact": "A sneeze can travel at speeds of over 100 miles per hour.", "category": "Human Body" },
  { "id": 78, "fact": "Butterflies can see ultraviolet light, which is invisible to humans.", "category": "Animals" },
  { "id": 79, "fact": "Venus rotates clockwise, opposite from most other planets.", "category": "Space" },
  { "id": 80, "fact": "Pine trees can communicate with each other using underground fungal networks.", "category": "Biology" },
  { "id": 81, "fact": "The world's smallest reptile is a chameleon that is smaller than a paperclip.", "category": "Animals" },
  { "id": 82, "fact": "The Milky Way galaxy is on a collision course with the Andromeda galaxy, expected in about 4 billion years.", "category": "Space" },
  { "id": 83, "fact": "A cockroach can live for several weeks without its head.", "category": "Animals" },
  { "id": 84, "fact": "There are more bacteria in your body than human cells.", "category": "Human Body" },
  { "id": 85, "fact": "Saturn's moon Titan has lakes of liquid methane and ethane.", "category": "Space" },
  { "id": 86, "fact": "The fastest insect is the dragonfly, able to fly up to 36 mph.", "category": "Animals" },
  { "id": 87, "fact": "The planet Neptune was mathematically predicted before it was visually observed.", "category": "Space" },
  { "id": 88, "fact": "Slugs have four noses.", "category": "Animals" },
  { "id": 89, "fact": "Your bones are constantly being broken down and rebuilt, with a completely new skeleton every 10 years.", "category": "Human Body" },
  { "id": 90, "fact": "Ants can carry objects up to 50 times their own body weight.", "category": "Animals" },
  { "id": 91, "fact": "Fireflies produce their own light through a chemical reaction called bioluminescence.", "category": "Animals" },
  { "id": 92, "fact": "Jupiter's Great Red Spot is a giant storm that has lasted at least 400 years.", "category": "Space" },
  { "id": 93, "fact": "Polar bear fur is actually transparent and hollow; it just appears white.", "category": "Animals" },
  { "id": 94, "fact": "The sun accounts for 99.86% of the total mass of our Solar System.", "category": "Space" },
  { "id": 95, "fact": "The average person sheds about 600,000 particles of skin every hour.", "category": "Human Body" },
  { "id": 96, "fact": "Some spiders can glide or parachute for distances, using their silk threads.", "category": "Animals" },
  { "id": 97, "fact": "The first living creatures to go into space were fruit flies.", "category": "History" },
  { "id": 98, "fact": "Venus is the hottest planet in the Solar System with surface temperatures up to 900°F (475°C).", "category": "Space" },
  { "id": 99, "fact": "The tongue print of a person is as unique as their fingerprint.", "category": "Human Body" },
  { "id": 100, "fact": "Dinosaurs roamed the Earth for around 165 million years.", "category": "History" },
  { "id": 101, "fact": "The electric eel can produce a shock of up to 600 volts.", "category": "Animals" },
  { "id": 102, "fact": "A jellyfish’s body is composed of 95% water.", "category": "Animals" },
  { "id": 103, "fact": "The Earth's core is as hot as the surface of the sun, around 10,800°F (6,000°C).", "category": "Science" },
  { "id": 104, "fact": "Crows are known to recognize individual human faces and remember them for years.", "category": "Animals" },
  { "id": 105, "fact": "Fruit bats navigate by echolocation similar to dolphins.", "category": "Animals" },
  { "id": 106, "fact": "A day on Mercury lasts about 59 Earth days.", "category": "Space" },
  { "id": 107, "fact": "The Eiffel Tower weighs about 10,000 tons.", "category": "Science" },
  { "id": 108, "fact": "Bees have five eyes – two large compound eyes and three smaller simple eyes.", "category": "Animals" },
  { "id": 109, "fact": "The longest recorded flight of a chicken is 13 seconds.", "category": "Animals" },
  { "id": 110, "fact": "The deepest part of the ocean, the Mariana Trench, is about 36,070 feet deep.", "category": "Science" },
  { "id": 111, "fact": "Butterflies taste with sensors on their feet.", "category": "Animals" },
  { "id": 112, "fact": "The human body has enough fat to produce more than seven bars of soap.", "category": "Human Body" },
  { "id": 113, "fact": "Rats laugh when tickled.", "category": "Animals" },
  { "id": 114, "fact": "The only letter that doesn't appear on the periodic table is the letter J.", "category": "Science" },
  { "id": 115, "fact": "A group of jellyfish is called a bloom, smack, or swarm.", "category": "Animals" },
  { "id": 116, "fact": "Fingernails grow faster on your dominant hand.", "category": "Human Body" },
  { "id": 117, "fact": "Starfish can regenerate lost arms, and some species can regrow an entirely new starfish from a single arm.", "category": "Animals" },
  { "id": 118, "fact": "The banana is a herb, not a tree or fruit.", "category": "Science" },
  { "id": 119, "fact": "The coldest temperature ever recorded on Earth was -128.6°F (-89.2°C) in Antarctica.", "category": "Weather" },
  { "id": 120, "fact": "The average human body contains enough sulfur to kill all fleas on an average dog.", "category": "Human Body" },
  { "id": 121, "fact": "The first ever VCR, made in 1956, was the size of a piano.", "category": "History" },
  { "id": 122, "fact": "Napoleon was once attacked by a horde of rabbits.", "category": "History" },
  { "id": 123, "fact": "Dogs' noses are wet to help absorb scent chemicals.", "category": "Animals" },
  { "id": 124, "fact": "The Great Pyramid was the tallest man-made structure for over 3,800 years.", "category": "History" },
  { "id": 125, "fact": "The hummingbird is the only bird that can fly backwards.", "category": "Animals" },
  { "id": 126, "fact": "A single bolt of lightning contains enough energy to toast 100,000 slices of bread.", "category": "Weather" },
  { "id": 127, "fact": "Whales can hold their breath for over an hour.", "category": "Animals" },
  { "id": 128, "fact": "Water covers 71% of Earth's surface.", "category": "Science" },
  { "id": 129, "fact": "The word 'droid' from Star Wars is a trademarked term by Lucasfilm.", "category": "Random" },
  { "id": 130, "fact": "The human eye can distinguish about 10 million different colors.", "category": "Human Body" },
  { "id": 131, "fact": "Sharks can detect a drop of blood in 25 gallons (100 liters) of water.", "category": "Animals" },
  { "id": 132, "fact": "A narwhal's tusk reveals its health and life history.", "category": "Animals" },
  { "id": 133, "fact": "The shortest commercial flight in the world lasts 57 seconds.", "category": "Random" },
  { "id": 134, "fact": "Humans and giraffes have the same number of neck vertebrae.", "category": "Biology" },
  { "id": 135, "fact": "Venus spins so slowly that its day is longer than its year.", "category": "Space" },
  { "id": 136, "fact": "The Sahara Desert was once a tropical rainforest.", "category": "Science" },
  { "id": 137, "fact": "Kangaroos can't walk backwards.", "category": "Animals" },
  { "id": 138, "fact": "The largest volcano in the solar system is Olympus Mons on Mars.", "category": "Space" },
  { "id": 139, "fact": "Elephants can hear with their feet.", "category": "Animals" },
  { "id": 140, "fact": "The world's longest recorded flight of a chicken is 13 seconds.", "category": "Animals" },
  { "id": 141, "fact": "Humans glow faintly, but the light is 1,000 times weaker than our eyes can perceive.", "category": "Human Body" },
  { "id": 142, "fact": "Some turtles can survive without oxygen for up to an entire year.", "category": "Animals" },
  { "id": 143, "fact": "The longest eclipse of the sun could last over 7 minutes.", "category": "Space" },
  { "id": 144, "fact": "Mosquitoes are attracted to people who have recently eaten bananas.", "category": "Animals" },
  { "id": 145, "fact": "The speed of sound is slower in water than in air.", "category": "Science" },
  { "id": 146, "fact": "The Earth's magnetic poles have flipped many times throughout history.", "category": "Science" },
  { "id": 147, "fact": "The average cumulus cloud weighs about 1 million pounds.", "category": "Weather" },
  { "id": 148, "fact": "Humans share roughly 60% of their DNA with bananas.", "category": "Biology" },
  { "id": 149, "fact": "The Mariana Trench is home to fish that can survive under immense pressure.", "category": "Science" },
  { "id": 150, "fact": "Jupiter has 79 known moons.", "category": "Space" },
  { "id": 151, "fact": "Sharks have no bones; their skeletons are made of cartilage.", "category": "Animals" },
  { "id": 152, "fact": "The oldest known living animal was a clam named Ming, which lived 507 years.", "category": "Animals" },
  { "id": 153, "fact": "Alaska is the state with the highest percentage of people who walk or bike to work.", "category": "Random" },
  { "id": 154, "fact": "A bolt of lightning is five times hotter than the sun's surface.", "category": "Weather" },
  { "id": 155, "fact": "The average person blinks about 15-20 times per minute.", "category": "Human Body" },
  { "id": 156, "fact": "Oysters can change gender several times during their lives.", "category": "Animals" },
  { "id": 157, "fact": "A hummingbird's heart can beat up to 1,260 times per minute.", "category": "Animals" },
  { "id": 158, "fact": "Sound travels faster in steel than in air.", "category": "Science" },
  { "id": 159, "fact": "Sloths can rotate their heads almost 270 degrees.", "category": "Animals" },
  { "id": 160, "fact": "The human body produces about one liter of saliva daily.", "category": "Human Body" },
  { "id": 161, "fact": "The Sahara Desert is expanding at a rate of about 0.8 kilometers per month.", "category": "Science" },
  { "id": 162, "fact": "The brain is capable of generating more electrical impulses in a single day than all the world's telephones combined.", "category": "Human Body" },
  { "id": 163, "fact": "Elephants are the only animals that can't jump.", "category": "Animals" },
  { "id": 164, "fact": "Humans have more than 600 muscles in their body.", "category": "Human Body" },
  { "id": 165, "fact": "Saturn's rings are surprisingly young – only around 100 million years old.", "category": "Space" },
  { "id": 166, "fact": "The platypus is one of the few mammals that lay eggs.", "category": "Animals" },
  { "id": 167, "fact": "Earthquakes can cause the length of a day to change.", "category": "Science" },
  { "id": 168, "fact": "Snakes can sense infrared light through special pits on their faces.", "category": "Animals" },
  { "id": 169, "fact": "The phrase 'raining cats and dogs' originates from 17th century England.", "category": "History" },
  { "id": 170, "fact": "Some fish can walk on land using their fins.", "category": "Animals" },
  { "id": 171, "fact": "The deadliest earthquake in recorded history was in Shaanxi, China, in 1556.", "category": "History" },
  { "id": 172, "fact": "Pluto was considered the ninth planet until 2006, when it was reclassified as a dwarf planet.", "category": "Space" },
  { "id": 173, "fact": "Honeybees communicate by dancing.", "category": "Animals" },
  { "id": 174, "fact": "The total weight of all ants on Earth is roughly equal to the weight of all humans.", "category": "Animals" },
  { "id": 175, "fact": "Your brain is sometimes more active during sleep than when you're awake.", "category": "Human Body" },
  { "id": 176, "fact": "Cats can jump up to six times their body length in a single leap.", "category": "Animals" },
  { "id": 177, "fact": "The world's largest recorded snowflake was 15 inches wide.", "category": "Weather" },
  { "id": 178, "fact": "Some plants can communicate through the air by releasing chemical signals.", "category": "Biology" },
  { "id": 179, "fact": "The bones in an adult human body number 206.", "category": "Human Body" },
  { "id": 180, "fact": "Sloths can hold their breath longer than dolphins can.", "category": "Animals" },
  { "id": 181, "fact": "The moon is moving away from Earth at a rate of about 3.8 centimeters per year.", "category": "Space" },
  { "id": 182, "fact": "Chameleons change color to communicate and regulate temperature, not just camouflage.", "category": "Animals" },
  { "id": 183, "fact": "Venomous cone snails can shoot harpoon-like teeth to paralyze prey.", "category": "Animals" },
  { "id": 184, "fact": "Human saliva contains enzymes that start digesting food before it reaches your stomach.", "category": "Human Body" },
  { "id": 185, "fact": "The Eiffel Tower was initially intended to be dismantled after 20 years.", "category": "History" },
  { "id": 186, "fact": "Some lizards can squirt blood from their eyes as a defense mechanism.", "category": "Animals" },
  { "id": 187, "fact": "The blood of horseshoe crabs is blue because it uses copper for oxygen transport.", "category": "Animals" },
  { "id": 188, "fact": "Lightning strikes produce ozone, which is why the air smells fresh after a storm.", "category": "Weather" },
  { "id": 189, "fact": "The human liver can regenerate itself from as little as 25% tissue.", "category": "Human Body" },
  { "id": 190, "fact": "Bees can recognize human faces.", "category": "Animals" },
  { "id": 191, "fact": "The world's oldest known animal cave painting is over 40,000 years old.", "category": "History" },
  { "id": 192, "fact": "A hummingbird's wings beat up to 80 times per second.", "category": "Animals" },
  { "id": 193, "fact": "Some turtles can breathe through their butts during underwater hibernation.", "category": "Animals" },
  { "id": 194, "fact": "The planet Uranus rotates on its side.", "category": "Space" },
  { "id": 195, "fact": "Narwhals’ tusks are actually elongated teeth with sensory capability.", "category": "Animals" },
  { "id": 196, "fact": "Your bones are stronger than steel by weight.", "category": "Human Body" },
  { "id": 197, "fact": "Starfish have no brain but can still detect light and touch.", "category": "Animals" },
  { "id": 198, "fact": "The Amazon rainforest produces more than 20% of the world’s oxygen.", "category": "Science" },
  { "id": 199, "fact": "Water bears, or tardigrades, can survive extreme temperatures, radiation, and the vacuum of space.", "category": "Animals" },
  { "id": 200, "fact": "Plants can ‘hear’ insects chewing and respond by producing defensive chemicals.", "category": "Biology" }
]
